-- phpMyAdmin SQL Dump
-- version 3.4.10
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2013 年 01 月 08 日 11:45
-- 服务器版本: 5.1.63
-- PHP 版本: 5.3.5

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `examtest`
--

-- --------------------------------------------------------

DROP TABLE `category_info`;
DROP TABLE `exam_info`;
DROP TABLE `member_info`;
DROP TABLE `question_info`;

-- --------------------------------------------------------

--
-- 表的结构 `category_info`
--

CREATE TABLE IF NOT EXISTS `category_info` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `sid` varchar(5) NOT NULL,
  `pid` int(10) unsigned NOT NULL,
  `subid` text,
  `displayorder` smallint(3) unsigned NOT NULL DEFAULT '0' COMMENT '排序id',
  `weight` float(7,4) unsigned NOT NULL,
  `level` tinyint(1) unsigned NOT NULL,
  `name` varchar(255) NOT NULL,
  `rule` text,
  `maxnum` smallint(5) unsigned DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `level` (`level`),
  KEY `sid` (`sid`),
  KEY `pid` (`pid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=248 ;

--
-- 转存表中的数据 `category_info`
--

INSERT INTO `category_info` (`id`, `sid`, `pid`, `subid`, `displayorder`, `weight`, `level`, `name`, `rule`, `maxnum`) VALUES
(2, '01', 0, '6,27,57,245,246,247,', 0, 100.0000, 0, '税务总监', '', 0),
(3, '02', 0, '126,147,175', 0, 100.0000, 0, '企业办税员', '', 0),
(4, '03', 0, '68,89,117', 0, 100.0000, 0, '税务经理', '', 0),
(5, '04', 0, '184,205,236', 0, 100.0000, 0, '注册税务师', '', 0),
(6, '01', 2, '7,13,20', 0, 30.0000, 1, '心理素质', 'a:3:{i:0;s:51:"有待提升自身心理素质、适应岗位要求";i:18;s:48:"心理素质优良，符合岗位基本要求。";i:24;s:42:"心理素质过硬，工作适应性强。";}', 0),
(7, '01', 6, '8,9,10,11,12', 0, 10.0000, 2, '价值观', '', 30),
(8, '01', 7, NULL, 0, 2.4000, 3, '遵纪守法', 'a:3:{i:0;s:27:"遵纪守法意识淡薄。";s:3:"1.2";s:24:"有遵纪守法意识。";s:6:"1.2001";s:36:"具有很强的遵纪守法意识。";}', 0),
(9, '02', 7, NULL, 0, 2.0000, 3, '正直客观', 'a:3:{i:0;s:69:"此人较世故，有时缺乏原则性、热情，感性＞理性。";i:1;s:24:"较为正直、客观。";s:6:"1.0001";s:75:"此人正直、客观，能够较好的进行企业税务的管理工作。";}', 0),
(10, '03', 7, NULL, 0, 2.2000, 3, '政策水平', 'a:3:{i:0;s:57:"缺乏相关税收政策法规，今后需加强学习。";s:3:"1.1";s:60:"能较好掌握相关政策，为注税实践打好基础。";s:6:"1.1001";s:54:"具有较高政策水平，能够指导税务实践。";}', 0),
(11, '04', 7, NULL, 0, 1.8000, 3, '终身学习责任', 'a:3:{i:0;s:57:"学习意识不够强，加强学习，不要吃老本。";s:3:"0.9";s:30:"具有一定的学习意识。";s:6:"0.9001";s:54:"学习是一种责任，具有很强的学习意识。";}', 0),
(12, '05', 7, NULL, 0, 1.6000, 3, '关注公众利益和社会责任', 'a:3:{i:0;s:48:"缺少关注公共利益和社会责任意识。";s:3:"0.8";s:54:"比较具备关注公共利益和社会责任意识。";s:6:"0.8001";s:48:"具有关注公共利益和社会责任意识。";}', 0),
(13, '2', 6, '14,15,16,17,18,19', 0, 10.0000, 2, '智力', 'a:3:{i:0;s:12:"勤能补拙";i:6;s:12:"智力优良";i:8;s:12:"智力优秀";}', 0),
(14, '01', 13, NULL, 0, 1.6000, 3, '遣词造句', '', 0),
(15, '02', 13, NULL, 0, 1.8000, 3, '数理分析', '', 0),
(16, '03', 13, NULL, 0, 1.5000, 3, '选择判断', '', 0),
(17, '04', 13, NULL, 0, 1.8000, 3, '逻辑推理', '', 0),
(18, '05', 13, NULL, 0, 1.8000, 3, '排列组合', '', 0),
(19, '06', 13, NULL, 0, 1.5000, 3, '空间思维', '', 0),
(20, '03', 6, '21,22,23,24,25,26', 0, 10.0000, 2, '人格', 'a:3:{i:0;s:66:"此人较世故，有时缺乏原则性、热情，感性＞理性";s:3:"1.1";s:21:"较为正直、客观";s:6:"1.1001";s:72:"此人正直、客观，能够较好的进行企业税务的管理工作";}', 0),
(21, '01', 20, NULL, 0, 1.6666, 3, '稳定', '', 0),
(22, '02', 20, NULL, 0, 1.6666, 3, '恃强', '', 0),
(23, '03', 20, NULL, 0, 1.6667, 3, '有恒', '', 0),
(24, '04', 20, NULL, 0, 1.6667, 3, '独立', '', 0),
(25, '05', 20, NULL, 0, 1.6667, 3, '自律', '', 0),
(26, '06', 20, NULL, 0, 1.6667, 3, '世故', '', 0),
(27, '02', 2, '28,35', 0, 30.0000, 1, '文化素质', '', 90),
(28, '01', 27, '29,30,31,32,33,34', 0, 12.0000, 2, '知识素质', 'a:3:{i:0;s:24:"提升自身的知识面";s:3:"7.2";s:15:"知识面较广";s:3:"9.6";s:12:"知识渊博";}', 36),
(29, '01', 28, NULL, 0, 2.0000, 3, '人文', '', 0),
(30, '02', 28, NULL, 0, 2.0000, 3, '社科', '', 0),
(31, '03', 28, NULL, 0, 2.0000, 3, '自然', '', 0),
(32, '04', 28, NULL, 0, 2.0000, 3, '艺术', '', 0),
(33, '05', 28, NULL, 0, 2.0000, 3, '哲学', '', 0),
(34, '06', 28, NULL, 0, 2.0000, 3, '外语', '', 0),
(35, '02', 27, '36,42,47', 0, 18.0000, 2, '专业素质', 'a:3:{i:0;s:66:"此人较世故，有时缺乏原则性、热情，感性＞理性";s:3:"1.1";s:21:"较为正直、客观";s:6:"1.1001";s:72:"此人正直、客观，能够较好的进行企业税务的管理工作";}', 54),
(36, '01', 35, '37,38,39,40,41', 0, 7.3334, 3, '税务、财务及相关知识', '', 22),
(37, '01', 36, NULL, 0, 1.3333, 4, '国际国内会计准则', '', 4),
(38, '02', 36, NULL, 0, 1.3333, 4, '财务管理', '', 4),
(39, '03', 36, NULL, 0, 1.6665, 4, '高级税务', '', 5),
(40, '04', 36, NULL, 0, 1.6665, 4, '经济法学', '', 5),
(41, '05', 36, NULL, 0, 1.3333, 4, '审计与统计', '', 4),
(42, '02', 35, '43,44,45,46', 0, 4.0000, 3, '信息技术知识', '', 12),
(43, '01', 42, NULL, 0, 0.6666, 4, '企业信息知识', '', 2),
(44, '02', 42, NULL, 0, 1.0000, 4, '信息环境下的内部控制', '', 3),
(45, '03', 42, NULL, 0, 1.3334, 4, '纳税申报软件的管理与应用', '', 4),
(46, '04', 42, NULL, 0, 1.0000, 4, '财务管理软件的应用', '', 3),
(47, '03', 35, '48,49,50,51,52,53,54,55,56', 0, 6.6667, 3, '组织行为和经营管理知识', '', 20),
(48, '01', 47, NULL, 0, 1.0000, 4, '风险管理', '', 3),
(49, '02', 47, NULL, 0, 0.6667, 4, '战略管理', '', 2),
(50, '03', 47, NULL, 0, 0.6667, 4, '管理学', '', 2),
(51, '04', 47, NULL, 0, 0.6667, 4, '金融学', '', 2),
(52, '05', 47, NULL, 0, 1.0000, 4, '投融资', '', 3),
(53, '06', 47, NULL, 0, 0.6667, 4, '经济学', '', 2),
(54, '07', 47, NULL, 0, 0.6667, 4, '企业与环境', '', 2),
(55, '08', 47, NULL, 0, 0.6666, 4, '数量方法和统计', '', 2),
(56, '09', 47, NULL, 0, 0.6666, 4, '营销学', '', 2),
(57, '03', 2, '58,59,60,61,62,63,64,65,66,67', 0, 40.0000, 1, '职业技能', 'a:3:{i:0;s:51:"职业技能有待提升，胜任能力有待加强";i:26;s:66:"具有较强的职业技能，在岗位上还有很多提升空间";i:30;s:63:"具有很强的职业技能，会在岗位上发挥建设作用";}', 60),
(58, '01', 57, NULL, 0, 4.4000, 2, '沟通及协调能力', '', 6),
(59, '02', 57, NULL, 0, 4.4000, 2, '决策能力', '', 6),
(60, '03', 57, NULL, 0, 4.4000, 2, '系统分析能力', '', 6),
(61, '04', 57, NULL, 0, 4.0000, 2, '逻辑性和批判性思维能力', '', 6),
(62, '05', 57, NULL, 0, 4.0000, 2, '团队合作能力', '', 6),
(63, '06', 57, NULL, 0, 4.0000, 2, '解决问题能力', '', 6),
(64, '07', 57, NULL, 0, 4.0000, 2, '管理和监督能力', '', 6),
(65, '08', 57, NULL, 0, 3.6000, 2, '人际交往能力', '', 6),
(66, '09', 57, NULL, 0, 3.6000, 2, '应对压力及合理安排时间的能力', '', 6),
(67, '10', 57, NULL, 0, 3.6000, 2, '国际竞争力', '', 6),
(68, '01', 4, '69,75,82', 0, 30.0000, 1, '心理素质', 'a:3:{i:0;s:66:"此人较世故，有时缺乏原则性、热情，感性＞理性";s:3:"1.1";s:21:"较为正直、客观";s:6:"1.1001";s:72:"此人正直、客观，能够较好的进行企业税务的管理工作";}', 0),
(69, '01', 68, '70,71,72,73,74', 0, 10.0000, 2, '价值观', NULL, 30),
(70, '01', 69, '', 0, 2.4000, 3, '遵纪守法', 'a:3:{i:0;s:27:"遵纪守法意识淡薄。";s:3:"1.2";s:24:"有遵纪守法意识。";s:6:"1.2001";s:36:"具有很强的遵纪守法意识。";}', 0),
(71, '02', 69, NULL, 0, 2.2000, 3, '正直客观', 'a:3:{i:0;s:66:"此人较世故，有时缺乏原则性、热情，感性＞理性";s:3:"1.1";s:21:"较为正直、客观";s:6:"1.1001";s:72:"此人正直、客观，能够较好的进行企业税务的管理工作";}', 0),
(72, '03', 69, NULL, 0, 2.0000, 3, '政策水平', 'a:3:{i:0;s:66:"此人较世故，有时缺乏原则性、热情，感性＞理性";s:3:"1.1";s:21:"较为正直、客观";s:6:"1.1001";s:72:"此人正直、客观，能够较好的进行企业税务的管理工作";}', 0),
(73, '04', 69, NULL, 0, 1.8000, 3, '终身学习责任', 'a:3:{i:0;s:57:"学习意识不够强，加强学习，不要吃老本。";s:3:"0.9";s:30:"具有一定的学习意识。";s:6:"0.9001";s:54:"学习是一种责任，具有很强的学习意识。";}', 0),
(74, '05', 69, NULL, 0, 1.6000, 3, '关注公众利益和社会责任', 'a:3:{i:0;s:48:"缺少关注公共利益和社会责任意识。";s:3:"0.8";s:54:"比较具备关注公共利益和社会责任意识。";s:6:"0.8001";s:48:"具有关注公共利益和社会责任意识。";}', 0),
(75, '02', 68, '76,77,78,79,80,81', 0, 10.0000, 2, '智力', 'a:3:{i:0;s:12:"勤能补拙";i:6;s:12:"智力优良";i:8;s:12:"智力优秀";}', 0),
(76, '01', 75, NULL, 0, 1.6000, 3, '遣词造句', NULL, 0),
(77, '02', 75, NULL, 0, 1.8000, 3, '数理分析', NULL, 0),
(78, '03', 75, NULL, 0, 1.5000, 3, '选择判断', NULL, 0),
(79, '04', 75, NULL, 0, 1.8000, 3, '逻辑推理', NULL, 0),
(80, '05', 75, NULL, 0, 1.8000, 3, '排列组合', NULL, 0),
(81, '06', 75, NULL, 0, 1.5000, 3, '空间思维', NULL, 0),
(82, '03', 68, '83,84,85,86,87,88', 0, 10.0000, 2, '人格', 'a:3:{i:0;s:66:"此人较世故，有时缺乏原则性、热情，感性＞理性";s:3:"1.1";s:21:"较为正直、客观";s:6:"1.1001";s:72:"此人正直、客观，能够较好的进行企业税务的管理工作";}', 30),
(83, '01', 82, NULL, 0, 1.6666, 3, '稳定', NULL, 0),
(84, '02', 82, NULL, 0, 1.6666, 3, '恃强', NULL, 0),
(85, '03', 82, NULL, 0, 1.6667, 3, '有恒', NULL, 0),
(86, '04', 82, NULL, 0, 1.6667, 3, '独立', NULL, 0),
(87, '05', 82, NULL, 0, 1.6667, 3, '自律', NULL, 0),
(88, '06', 82, NULL, 0, 1.6667, 3, '实验', NULL, 0),
(89, '02', 4, '90,97', 0, 30.0000, 1, '文化素质', NULL, 90),
(90, '01', 89, '91,92,93,94,95,96', 0, 12.0000, 2, '知识素质', 'a:3:{i:0;s:24:"提升自身的知识面";s:3:"7.2";s:15:"知识面较广";s:3:"9.6";s:12:"知识渊博";}', 36),
(91, '01', 90, NULL, 0, 2.0000, 3, '人文', NULL, 0),
(92, '02', 90, NULL, 0, 2.0000, 3, '社科', NULL, 0),
(93, '03', 90, NULL, 0, 2.0000, 3, '自然', NULL, 0),
(94, '04', 90, NULL, 0, 2.0000, 3, '艺术', NULL, 0),
(95, '05', 90, NULL, 0, 2.0000, 3, '哲学', NULL, 0),
(96, '06', 90, NULL, 0, 2.0000, 3, '外语', NULL, 0),
(97, '02', 89, '98,104,109', 0, 18.0000, 2, '专业素质', 'a:3:{i:0;s:66:"此人较世故，有时缺乏原则性、热情，感性＞理性";s:3:"1.1";s:21:"较为正直、客观";s:6:"1.1001";s:72:"此人正直、客观，能够较好的进行企业税务的管理工作";}', 54),
(98, '01', 97, '99,100,101,102,103', 0, 6.9933, 3, '税务、财务及相关知识', NULL, 21),
(99, '01', 98, NULL, 0, 1.3333, 4, '会计准则', NULL, 4),
(100, '02', 98, NULL, 0, 1.6666, 4, '财务管理', NULL, 5),
(101, '03', 98, NULL, 0, 1.6665, 4, '税收筹划分析', NULL, 5),
(102, '04', 98, NULL, 0, 1.0000, 4, '经济法学', NULL, 3),
(103, '05', 98, NULL, 0, 1.3333, 4, '审计与统计', NULL, 4),
(104, '02', 97, '105,106,107,108', 0, 4.9950, 3, '信息技术知识', NULL, 15),
(105, '01', 104, NULL, 0, 0.6666, 4, '企业信息知识', NULL, 2),
(106, '02', 104, NULL, 0, 1.0000, 4, '信息环境下的内部控制', NULL, 3),
(107, '03', 104, NULL, 0, 1.3334, 4, '纳税申报软件的管理与应用', NULL, 4),
(108, '04', 104, NULL, 0, 1.0000, 4, '财务管理软件的应用', NULL, 3),
(109, '03', 97, '110,111,112,113,114,115,116', 0, 5.9940, 3, '组织行为和经营管理知识', NULL, 18),
(110, '01', 109, NULL, 0, 1.0000, 4, '风险管理', NULL, 3),
(111, '02', 109, NULL, 0, 1.0000, 4, '战略管理', NULL, 3),
(112, '03', 109, NULL, 0, 1.0000, 4, '管理学', NULL, 3),
(113, '04', 109, NULL, 0, 1.0000, 4, '金融学', NULL, 3),
(114, '05', 109, NULL, 0, 0.6667, 4, '经济学', NULL, 2),
(115, '06', 109, NULL, 0, 0.6667, 4, '企业与环境', NULL, 2),
(116, '07', 109, NULL, 0, 0.6666, 4, '营销学', NULL, 2),
(117, '03', 4, '118,119,120,121,122,123,124,125', 0, 40.0000, 1, '职业技能', 'a:3:{i:0;s:51:"职业技能有待提升，胜任能力有待加强";i:26;s:66:"具有较强的职业技能，在岗位上还有很多提升空间";i:30;s:63:"具有很强的职业技能，会在岗位上发挥建设作用";}', 60),
(118, '01', 117, NULL, 0, 5.2000, 2, '沟通及协调能力', NULL, 8),
(119, '03', 117, NULL, 0, 5.2000, 2, '系统分析能力', NULL, 8),
(120, '04', 117, NULL, 0, 5.2000, 2, '逻辑性和批判性思维能力', NULL, 8),
(121, '05', 117, NULL, 0, 5.0000, 2, '团队合作能力', NULL, 8),
(122, '06', 117, NULL, 0, 5.0000, 2, '解决问题能力', NULL, 7),
(123, '07', 117, NULL, 0, 4.8000, 2, '管理和监督能力', NULL, 7),
(124, '08', 117, NULL, 0, 4.8000, 2, '人际交往能力', NULL, 7),
(125, '09', 117, NULL, 0, 4.8000, 2, '应对压力及合理安排时间的能力', NULL, 7),
(126, '01', 3, '127,133,140', 0, 30.0000, 1, '心理素质', 'a:3:{i:0;s:51:"有待提升自身心理素质、适应岗位要求";i:18;s:48:"心理素质优良，符合岗位基本要求。";i:24;s:42:"心理素质过硬，工作适应性强。";}', 0),
(127, '01', 126, '128,129,130,131,132', 0, 10.0000, 2, '价值观', NULL, 30),
(128, '01', 127, NULL, 0, 2.4000, 3, '遵纪守法', 'a:3:{i:0;s:27:"遵纪守法意识淡薄。";s:3:"1.2";s:24:"有遵纪守法意识。";s:6:"1.2001";s:36:"具有很强的遵纪守法意识。";}', 0),
(129, '02', 127, NULL, 0, 2.2000, 3, '正直客观', 'a:3:{i:0;s:69:"此人较世故，有时缺乏原则性、热情，感性＞理性。";s:3:"1.1";s:24:"较为正直、客观。";s:6:"1.1001";s:75:"此人正直、客观，能够较好的进行企业税务的管理工作。";}', 0),
(130, '03', 127, NULL, 0, 2.0000, 3, '政策水平', 'a:3:{i:0;s:66:"此人较世故，有时缺乏原则性、热情，感性＞理性";s:3:"1.1";s:21:"较为正直、客观";s:6:"1.1001";s:72:"此人正直、客观，能够较好的进行企业税务的管理工作";}', 0),
(131, '04', 127, NULL, 0, 1.8000, 3, '终身学习责任', 'a:3:{i:0;s:57:"学习意识不够强，加强学习，不要吃老本。";s:3:"0.9";s:30:"具有一定的学习意识。";s:6:"0.9001";s:54:"学习是一种责任，具有很强的学习意识。";}', 0),
(132, '05', 127, NULL, 0, 1.6000, 3, '关注公众利益和社会责任', 'a:3:{i:0;s:48:"缺少关注公共利益和社会责任意识。";s:3:"0.8";s:54:"比较具备关注公共利益和社会责任意识。";s:6:"0.8001";s:48:"具有关注公共利益和社会责任意识。";}', 0),
(133, '02', 126, '134,135,136,137,138,139', 0, 10.0000, 2, '智力', 'a:3:{i:0;s:12:"勤能补拙";i:6;s:12:"智力优良";i:8;s:12:"智力优秀";}', 0),
(134, '01', 133, NULL, 0, 1.6000, 3, '遣词造句', NULL, 0),
(135, '02', 133, NULL, 0, 1.8000, 3, '数理分析', NULL, 0),
(136, '03', 133, NULL, 0, 1.5000, 3, '选择判断', NULL, 0),
(137, '04', 133, NULL, 0, 1.8000, 3, '逻辑推理', NULL, 0),
(138, '05', 133, NULL, 0, 1.8000, 3, '排列组合', NULL, 0),
(139, '06', 133, NULL, 0, 1.5000, 3, '空间思维', NULL, 0),
(140, '03', 126, '141,142,143,144,145,146', 0, 10.0000, 2, '人格', 'a:3:{i:0;s:66:"此人较世故，有时缺乏原则性、热情，感性＞理性";s:3:"1.1";s:21:"较为正直、客观";s:6:"1.1001";s:72:"此人正直、客观，能够较好的进行企业税务的管理工作";}', 30),
(141, '01', 140, NULL, 0, 1.6666, 3, '稳定', NULL, 0),
(142, '02', 140, NULL, 0, 1.6666, 3, '乐群', NULL, 0),
(143, '03', 140, NULL, 0, 1.6667, 3, '有恒', NULL, 0),
(144, '04', 140, NULL, 0, 1.6667, 3, '独立', NULL, 0),
(145, '05', 140, NULL, 0, 1.6667, 3, '自律', NULL, 0),
(146, '06', 140, NULL, 0, 1.6667, 3, '兴奋', NULL, 0),
(147, '02', 3, '148,155', 0, 30.0000, 1, '文化素质', NULL, 90),
(148, '01', 147, '149,150,151,152,153,154', 0, 12.0000, 2, '知识素质', 'a:3:{i:0;s:24:"提升自身的知识面";s:3:"7.2";s:15:"知识面较广";s:3:"9.6";s:12:"知识渊博";}', 36),
(149, '01', 148, NULL, 0, 2.0000, 3, '人文', NULL, 0),
(150, '02', 148, NULL, 0, 2.0000, 3, '社科', NULL, 0),
(151, '03', 148, NULL, 0, 2.0000, 3, '自然', NULL, 0),
(152, '04', 148, NULL, 0, 2.0000, 3, '艺术', NULL, 0),
(153, '05', 148, NULL, 0, 2.0000, 3, '哲学', NULL, 0),
(154, '06', 148, NULL, 0, 2.0000, 3, '外语', NULL, 0),
(155, '02', 147, '156,162,167', 0, 18.0000, 2, '专业素质', 'a:3:{i:0;s:66:"此人较世故，有时缺乏原则性、热情，感性＞理性";s:3:"1.1";s:21:"较为正直、客观";s:6:"1.1001";s:72:"此人正直、客观，能够较好的进行企业税务的管理工作";}', 54),
(156, '01', 155, '157,158,159,160,161', 0, 6.9933, 3, '税务、财务及相关知识', NULL, 21),
(157, '01', 156, NULL, 0, 1.3333, 4, '会计准则', NULL, 4),
(158, '02', 156, NULL, 0, 1.6666, 4, '财务管理', NULL, 5),
(159, '03', 156, NULL, 0, 1.6665, 4, '税收筹划分析', NULL, 5),
(160, '04', 156, NULL, 0, 1.0000, 4, '经济法学', NULL, 3),
(161, '05', 156, NULL, 0, 1.3333, 4, '审计与统计', NULL, 4),
(162, '02', 155, '163,164,165,166', 0, 4.9950, 3, '信息技术知识', NULL, 15),
(163, '01', 162, NULL, 0, 0.6666, 4, '企业信息知识', NULL, 2),
(164, '02', 162, NULL, 0, 1.0000, 4, '信息环境下的内部控制', NULL, 3),
(165, '03', 162, NULL, 0, 1.3334, 4, '纳税申报软件的管理与应用', NULL, 4),
(166, '04', 162, NULL, 0, 1.0000, 4, '财务管理软件的应用', NULL, 3),
(167, '03', 155, '168,169,170,171,172,173,174', 0, 5.9940, 3, '组织行为和经营管理知识', NULL, 18),
(168, '01', 167, NULL, 0, 1.0000, 4, '风险管理', NULL, 3),
(169, '02', 167, NULL, 0, 1.0000, 4, '战略管理', NULL, 3),
(170, '03', 167, NULL, 0, 1.0000, 4, '管理学', NULL, 3),
(171, '04', 167, NULL, 0, 1.0000, 4, '金融学', NULL, 3),
(172, '05', 167, NULL, 0, 0.6667, 4, '经济学', NULL, 2),
(173, '06', 167, NULL, 0, 0.6667, 4, '企业与环境', NULL, 2),
(174, '07', 167, NULL, 0, 0.6666, 4, '营销学', NULL, 2),
(175, '03', 3, '176,177,178,179,180,181,182,183', 0, 40.0000, 1, '职业技能', 'a:3:{i:0;s:51:"职业技能有待提升，胜任能力有待加强";i:26;s:66:"具有较强的职业技能，在岗位上还有很多提升空间";i:30;s:63:"具有很强的职业技能，会在岗位上发挥建设作用";}', 60),
(176, '01', 175, NULL, 0, 5.2000, 2, '沟通及协调能力', NULL, 8),
(177, '03', 175, NULL, 0, 5.2000, 2, '系统分析能力', NULL, 8),
(178, '04', 175, NULL, 0, 5.2000, 2, '逻辑性和批判性思维能力', NULL, 8),
(179, '05', 175, NULL, 0, 5.0000, 2, '团队合作能力', NULL, 8),
(180, '06', 175, NULL, 0, 5.0000, 2, '解决问题能力', NULL, 7),
(181, '07', 175, NULL, 0, 4.8000, 2, '管理和监督能力', NULL, 7),
(182, '08', 175, NULL, 0, 4.8000, 2, '人际交往能力', NULL, 7),
(183, '09', 175, NULL, 0, 4.8000, 2, '应对压力及合理安排时间的能力', NULL, 7),
(184, '01', 5, '185,191,198', 0, 30.0000, 1, '心理素质', 'a:3:{i:0;s:51:"有待提升自身心理素质、适应岗位要求";i:18;s:48:"心理素质优良，符合岗位基本要求。";i:24;s:42:"心理素质过硬，工作适应性强。";}', 0),
(185, '01', 184, '186,187,188,189,190', 0, 10.0000, 2, '价值观', NULL, 30),
(186, '01', 185, NULL, 0, 2.4000, 3, '遵纪守法', 'a:3:{i:0;s:27:"遵纪守法意识淡薄。";s:3:"1.2";s:24:"有遵纪守法意识。";s:6:"1.2001";s:36:"具有很强的遵纪守法意识。";}', 0),
(187, '02', 185, NULL, 0, 2.0000, 3, '正直客观', 'a:3:{i:0;s:69:"此人较世故，有时缺乏原则性、热情，感性＞理性。";i:1;s:24:"较为正直、客观。";s:6:"1.0001";s:75:"此人正直、客观，能够较好的进行企业税务的管理工作。";}', 0),
(188, '03', 185, NULL, 0, 2.2000, 3, '政策水平', 'a:3:{i:0;s:57:"缺乏相关税收政策法规，今后需加强学习。";s:3:"1.1";s:60:"能较好掌握相关政策，为注税实践打好基础。";s:6:"1.1001";s:54:"具有较高政策水平，能够指导税务实践。";}', 0),
(189, '04', 185, NULL, 0, 1.8000, 3, '终身学习责任', 'a:3:{i:0;s:57:"学习意识不够强，加强学习，不要吃老本。";s:3:"0.9";s:30:"具有一定的学习意识。";s:6:"0.9001";s:54:"学习是一种责任，具有很强的学习意识。";}', 0),
(190, '05', 185, NULL, 0, 1.6000, 3, '关注公众利益和社会责任', 'a:3:{i:0;s:48:"缺少关注公共利益和社会责任意识。";s:3:"0.8";s:54:"比较具备关注公共利益和社会责任意识。";s:6:"0.8001";s:48:"具有关注公共利益和社会责任意识。";}', 0),
(191, '02', 184, '192,193,194,195,196,197', 0, 10.0000, 2, '智力', 'a:3:{i:0;s:12:"勤能补拙";i:6;s:12:"智力优良";i:8;s:12:"智力优秀";}', 0),
(192, '01', 191, NULL, 0, 1.6000, 3, '遣词造句', NULL, 0),
(193, '02', 191, NULL, 0, 1.8000, 3, '数理分析', NULL, 0),
(194, '03', 191, NULL, 0, 1.5000, 3, '选择判断', NULL, 0),
(195, '04', 191, NULL, 0, 1.8000, 3, '逻辑推理', NULL, 0),
(196, '05', 191, NULL, 0, 1.8000, 3, '排列组合', NULL, 0),
(197, '06', 191, NULL, 0, 1.5000, 3, '空间思维', NULL, 0),
(198, '03', 184, '199,200,201,202,203,204', 0, 10.0000, 2, '人格', 'a:3:{i:0;s:66:"此人较世故，有时缺乏原则性、热情，感性＞理性";s:3:"1.1";s:21:"较为正直、客观";s:6:"1.1001";s:72:"此人正直、客观，能够较好的进行企业税务的管理工作";}', 30),
(199, '01', 198, NULL, 0, 1.6666, 3, '稳定', NULL, 0),
(200, '02', 198, NULL, 0, 1.6666, 3, '乐群', NULL, 0),
(201, '03', 198, NULL, 0, 1.6667, 3, '有恒', NULL, 0),
(202, '04', 198, NULL, 0, 1.6667, 3, '独立', NULL, 0),
(203, '05', 198, NULL, 0, 1.6667, 3, '兴奋', NULL, 0),
(204, '06', 198, NULL, 0, 1.6667, 3, '实验', NULL, 0),
(205, '02', 5, '206,213', 0, 30.0000, 1, '文化素质', NULL, 90),
(206, '01', 205, '207,208,209,210,211,212', 0, 12.0000, 2, '知识素质', 'a:3:{i:0;s:24:"提升自身的知识面";s:3:"7.2";s:15:"知识面较广";s:3:"9.6";s:12:"知识渊博";}', 36),
(207, '01', 206, NULL, 0, 2.0000, 3, '人文', NULL, 6),
(208, '02', 206, NULL, 0, 2.0000, 3, '社科', NULL, 6),
(209, '03', 206, NULL, 0, 2.0000, 3, '自然', NULL, 6),
(210, '04', 206, NULL, 0, 2.0000, 3, '艺术', NULL, 6),
(211, '05', 206, NULL, 0, 2.0000, 3, '哲学', NULL, 6),
(212, '06', 206, NULL, 0, 2.0000, 3, '外语', NULL, 6),
(213, '02', 205, '214,221,226', 0, 18.0000, 2, '专业素质', 'a:3:{i:0;s:66:"此人较世故，有时缺乏原则性、热情，感性＞理性";s:3:"1.1";s:21:"较为正直、客观";s:6:"1.1001";s:72:"此人正直、客观，能够较好的进行企业税务的管理工作";}', 54),
(214, '01', 213, '215,216,217,218,219,220', 0, 6.6667, 3, '税务、财务及相关知识', NULL, 20),
(215, '01', 214, NULL, 0, 1.3333, 4, '国际国内会计准则', NULL, 4),
(216, '02', 214, NULL, 0, 1.0000, 4, '财务管理', NULL, 3),
(217, '03', 214, NULL, 0, 1.3333, 4, '最新税收法规', NULL, 4),
(218, '04', 214, NULL, 0, 1.0000, 4, '经济法学', NULL, 3),
(219, '05', 214, NULL, 0, 1.0000, 4, '审计与统计', NULL, 3),
(220, '06', 214, NULL, 0, 1.0000, 4, '税务代理流程操作与控制', NULL, 3),
(221, '02', 213, '222,223,224,225', 0, 6.0000, 3, '信息技术知识', NULL, 18),
(222, '01', 221, NULL, 0, 1.3333, 4, '企业信息知识', NULL, 4),
(223, '02', 221, NULL, 0, 1.3333, 4, '信息环境下的内部控制', NULL, 4),
(224, '03', 221, NULL, 0, 1.6666, 4, '纳税申报软件的管理与应用', NULL, 5),
(225, '04', 221, NULL, 0, 1.6666, 4, '财务管理软件的管理与应用', NULL, 5),
(226, '03', 213, '227,228,229,230,231,232,233,234,235', 0, 5.3333, 3, '组织行为和经营管理知识', NULL, 16),
(227, '01', 226, NULL, 0, 0.6666, 4, '风险管理', NULL, 2),
(228, '02', 226, NULL, 0, 0.3333, 4, '战略管理', NULL, 1),
(229, '03', 226, NULL, 0, 0.6666, 4, '管理学', NULL, 2),
(230, '04', 226, NULL, 0, 0.6666, 4, '金融学', NULL, 2),
(231, '05', 226, NULL, 0, 0.6667, 4, '经济学', NULL, 2),
(232, '06', 226, NULL, 0, 0.3333, 4, '企业与环境', NULL, 1),
(233, '07', 226, NULL, 0, 0.3333, 4, '营销学', NULL, 1),
(234, '08', 226, NULL, 0, 1.0000, 4, '税务代理实务', NULL, 3),
(235, '09', 226, NULL, 0, 0.6666, 4, '数量方法和统计', NULL, 2),
(236, '03', 5, '237,238,239,240,241,242,243', 0, 40.0000, 1, '职业技能', 'a:3:{i:0;s:51:"职业技能有待提升，胜任能力有待加强";i:26;s:66:"具有较强的职业技能，在岗位上还有很多提升空间";i:30;s:63:"具有很强的职业技能，会在岗位上发挥建设作用";}', 60),
(237, '01', 236, NULL, 0, 6.8000, 2, '沟通及协调能力', NULL, 9),
(238, '02', 236, NULL, 0, 6.4000, 2, '系统分析能力', NULL, 9),
(239, '03', 236, NULL, 0, 6.0000, 2, '逻辑性和批判性思维能力', NULL, 9),
(240, '04', 236, NULL, 0, 5.6000, 2, '团队合作能力', NULL, 9),
(241, '05', 236, NULL, 0, 5.2000, 2, '解决问题能力', NULL, 8),
(242, '06', 236, NULL, 0, 4.8000, 2, '人际交往能力', NULL, 8),
(243, '07', 236, NULL, 0, 5.2000, 2, '应对压力及合理安排时间的能力', NULL, 8),
(244, '01', 69, '', 0, 2.4000, 3, '遵纪守法', '', 0);

-- --------------------------------------------------------

--
-- 表的结构 `exam_info`
--

CREATE TABLE IF NOT EXISTS `exam_info` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL,
  `cid` int(10) unsigned NOT NULL,
  `starttime` datetime DEFAULT NULL,
  `endtime` datetime DEFAULT NULL,
  `evaluation` text,
  `status` tinyint(4) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;


--
-- 表的结构 `member_info`
--

CREATE TABLE IF NOT EXISTS `member_info` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `cardid` char(18) NOT NULL,
  `signtime` datetime NOT NULL,
  `name` varchar(48) NOT NULL,
  `age` tinyint(3) unsigned NOT NULL,
  `sex` tinyint(1) unsigned NOT NULL,
  `password` char(40) NOT NULL,
  `job` varchar(120) NOT NULL,
  `record` varchar(30) NOT NULL,
  `subjectlist` varchar(255) DEFAULT NULL,
  `status` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `note` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `cardid` (`cardid`),
  KEY `status` (`status`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=10001 ;



--
-- 表的结构 `question_info`
--

CREATE TABLE IF NOT EXISTS `question_info` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `csid` char(10) DEFAULT NULL,
  `question` text NOT NULL,
  `options` text NOT NULL,
  `picture` tinytext,
  `cid` varchar(100) NOT NULL,
  `catid` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `csid` (`csid`),
  KEY `cid` (`cid`),
  KEY `catid` (`catid`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;







/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
